THow-M/STM32_CAN_DVCS_Project/Firmware/ECU1_Body_Control/User/main.c
#include "stm32f10x.h"                  // Device header
#include "ecu1_main.h"
#include "System_Config.h"
#include "Serial.h"
#include "MyCAN.h"
#include "Timer.h"
#include "Delay.h"
#include "OLED.h"
#include "OLED2.h"
#include "Key.h"
#include "LED.h"
#include <string.h>
#include <stdlib.h>

// 全局变量
System_State system_state = SYSTEM_IDLE;
uint8_t selected_menu = 0;
uint32_t last_heartbeat_time = 0;
uint32_t last_display_time = 0;
uint32_t last_can_send_time = 0;
//static volatile uint8_t Key_Scan_Flag = 0;

/* CAN_Test_Mode 修复 */
static uint32_t g_last_rx_id = 0;
static uint8_t g_last_rx_data[8] = {0};
static uint8_t g_last_rx_len = 0;
static uint8_t g_rx_updated = 0;

static uint32_t g_heartbeat_period_ms = HEARTBEAT_PERIOD;

/* ---- 错误处理静态变量 ---- */
static ErrorReport_Data s_last_error = {0};    /* 最近一次收到的错误报告 */
static uint8_t s_error_pending = 0U;           /* 是否有待处理的错误 */

// CAN接收数据
SpeedCmd_Data speed_cmd = {0};
MotorStatus_Data motor_status = {0};
Sensor_Data sensor_data = {0};
uint8_t heartbeat_status[NODE_NUM] = {0};
uint32_t heartbeat_time[NODE_NUM] = {0};
uint16_t sensor_voltage_mv = 0U;

// 菜单项
const char *menu_items[] = {
    "1.Motor Ctrl",                      //远程控制电机
    "2.Sensor View",                     //显示传感器数据
    "3.System Mon",                      //系统状态监控
    "4.CAN Test",                        //CAN通信测试
    "5.Settings"                         //参数设置
};

#define MENU_COUNT (sizeof(menu_items) / sizeof(menu_items[0]))

/** 函  数：系统初始化
  * 参  数：无
  * 返回值：无
  */
void System_Init(void)
{
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	
    // 初始化外设
	Key_Init();
	Timer_Init();
    LED_Init();
    OLED_Init();
	OLED2_Init();
    Serial_Init(DEBUG_BAUDRATE);
    MyCAN_Init(CAN_BAUDRATE);
    
    printf("\r\n");
    printf("================================\r\n");
    printf("  ECU1 - Body Control Unit\r\n");
    printf("  Version: 1.0.0\r\n");
    printf("  Build Date: %s %s\r\n", __DATE__, __TIME__);
    printf("================================\r\n\r\n");
    
    // 系统启动指示
    LED1_ON();
    Delay_ms(500);
    LED2_ON();
    Delay_ms(500);
    LED3_ON();
    Delay_ms(500);
    
    LED1_OFF();
    LED2_OFF();
    LED3_OFF();
    
    // 显示启动界面
    OLED_Clear();
    OLED_ShowString(0, 0, "Vehicle Control", OLED_8X16);
    OLED_ShowString(0, 16, "ECU1-BodyControl", OLED_8X16);
    OLED_ShowString(0, 42, "Initializing...", OLED_8X16);
    OLED_Update();
	
    Delay_ms(2000);
    
    system_state = SYSTEM_READY;
	
	uint32_t boot_time = HAL_GetTick();
    for (uint8_t i = 0; i < NODE_NUM; i++)
    {
        heartbeat_time[i] = boot_time;  /* 给予所有节点启动宽限 */
    }
	
	/* 看门狗 */
	IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);
    IWDG_SetPrescaler(IWDG_Prescaler_64);   /* 40kHz/64 = 625Hz */
    IWDG_SetReload(0x0FFF);                  /* ~6.55s 超时 */
    IWDG_ReloadCounter();
    IWDG_Enable();
    
    printf("System initialized successfully!\r\n");
}

/** 函  数：主菜单显示
  * 参  数：无
  * 返回值：无
  */
void Show_MainMenu(void)
{
    OLED_Clear();
	OLED2_Clear();
    OLED2_ShowString(0, 0, "====Main Menu===", OLED_8X16);
    
    for(uint8_t i = 0; i < MENU_COUNT - 1; i++)
	{
        if(i == selected_menu)
		{
			OLED_ShowString(0, 16*i, ">" ,OLED_8X16);
        }
        OLED_ShowString(8, 16*i, (char*)menu_items[i] ,OLED_8X16);
    }
	//由于屏幕空间不够，第五项放到第二个oled上显示
	if(selected_menu == MENU_COUNT - 1)
	{
		OLED2_ShowString(0, 16, ">", OLED_8X16);
	}
	OLED2_ShowString(8 , 16, (char*)menu_items[MENU_COUNT - 1], OLED_8X16);
	
	OLED_Update();
	OLED2_Update();
}

/** 函  数：按键处理
  * 参  数：无
  * 返回值：无
  */
void Key_Handler(void)
{

	uint8_t key_value = Key_Check(KEY_SINGLE);
    
    if(key_value)
	{
		
        switch(key_value)
		{
            case KEY1_PRESS:  // 上
                if(selected_menu > 0)
				{
                    selected_menu--;
                }
				else
				{
                    selected_menu = MENU_COUNT - 1;
                }
                Show_MainMenu();
                break;
                
            case KEY2_PRESS:  // 下
                selected_menu = (selected_menu + 1) % MENU_COUNT;
                Show_MainMenu();
                break;
                
            case KEY3_PRESS:  // 确定
                Execute_Menu(selected_menu);
                break;
                
            case KEY4_PRESS:  // 返回/取消
                system_state = SYSTEM_READY;
                Show_MainMenu();
                break;
        }
    }
}

/** 函  数：执行菜单功能
  * 参  数：当前所选菜单索引
  * 返回值：无
  */
void Execute_Menu(uint8_t menu_index)
{
    switch(menu_index)
	{
        case 0:  // 远程控制电机
            Remote_Control_Mode();
            break;
            
        case 1:  // 显示传感器数据
            Sensor_Display_Mode();
            break;
            
        case 2:  // 系统状态监控
            System_Monitor_Mode();
            break;
            
        case 3:  // CAN通信测试
            CAN_Test_Mode();
            break;
            
        case 4:  // 参数设置
            Parameter_Setting_Mode();
            break;
    }
}

/** 函  数：远程控制电机模式
  * 参  数：无
  * 返回值：无
  */
void Remote_Control_Mode(void)
{
    uint8_t speed = 0;
    uint8_t direction = 1;  // 1=正转
	static uint8_t direction_switching = 0U;
	static uint8_t pending_direction = 0U;
	static uint32_t switch_start = 0U;
    
    system_state = REMOTE_CONTROL;
    
    while(system_state == REMOTE_CONTROL)
	{
		/*if (Key_Scan_Flag)
		{
			Key_Scan_Flag = 0;
			Key_Scan();
		}*/
		
		HeartBeat_Manager();
		
		uint32_t can_id;
        uint8_t can_data[8];
        uint8_t can_len;
        uint8_t rx_count = 0U;
        while (MyCAN_Receive_Message(&can_id, &can_len, can_data) 
               && rx_count < 8U)
        {
            CAN_Data_Handler(can_id, can_len, can_data);
            rx_count++;
        }
		
        // 处理按键
        uint8_t key = Key_Check(KEY_SINGLE);
        if(key == KEY4_PRESS)
		{
            system_state = SYSTEM_READY;
            break;
        }
        
        // 按键控制速度
        if(key == KEY1_PRESS)
		{   // 加速
            if(speed < 100) speed += 10;
        }
		else if(key == KEY2_PRESS)
		{   // 减速
            if(speed > 0) speed -= 10;
        }
		else if (key == KEY3_PRESS && !direction_switching)
		{
			direction_switching = 1U;
			pending_direction = (direction == 1) ? 2 : 1;
			switch_start = HAL_GetTick();
			/* 立即发送停止指令 */
			MyCAN_Send_SpeedCmd(0, 0, 100);
		}
		
		if (direction_switching &&
			(HAL_GetTick() - switch_start >= 200U) &&
			(abs(motor_status.actual_speed) <= 10))
		{
			direction = pending_direction;
			direction_switching = 0U;
		}
        
        // 发送速度指令
        if ((HAL_GetTick() - last_can_send_time) >= 100U)
		{
			uint8_t cmd_direction;
			int16_t cmd_speed;
		
			last_can_send_time = HAL_GetTick();
		
			if (direction_switching)
			{
				cmd_speed = 0;
				cmd_direction = 0;   /* MOTOR_STOP */
			}
			else
			{
				cmd_speed = (int16_t)speed * 10;
				cmd_direction = direction;
			}
		
