THow-M/STM32_CAN_DVCS_Project/Firmware/ECU1_Body_Control/User/main.c
			(void)MyCAN_Send_SpeedCmd(cmd_speed, cmd_direction, 50U);
		}
        
        // 显示控制界面
        OLED_Clear();
		OLED2_Clear();
        OLED2_ShowString(0, 0, "RemoteControlMod", OLED_8X16);
        OLED_ShowString(0, 0, "Speed:", OLED_8X16);
        OLED_ShowNum(48, 0, speed, 3 ,OLED_8X16);
        OLED_ShowString(72, 0, "%", OLED_8X16);
        
        OLED_ShowString(0, 16, "Dir:", OLED_8X16);
        if(direction == 1)
		{
            OLED_ShowString(32, 16, "Forward", OLED_8X16);
        }
		else
		{
            OLED_ShowString(32, 16, "Reverse", OLED_8X16);
        }
        
        OLED2_ShowString(0, 16, "Key1:V+", OLED_8X16);
        OLED2_ShowString(64, 16, "Key2:V-", OLED_8X16);
        OLED2_ShowString(0, 32, "Key3:Change Dir", OLED_8X16);
        OLED2_ShowString(0, 48, "Key4:Back", OLED_8X16);
        
		OLED_Update();
		OLED2_Update();
		
        Delay_ms(50);
		
		IWDG_ReloadCounter();
    }
}

/** 函  数：传感器数据显示模式
  * 参  数：无
  * 返回值：无
  */
void Sensor_Display_Mode(void)
{
    system_state = SENSOR_DISPLAY;
    
    while(system_state == SENSOR_DISPLAY)
	{
		/*if (Key_Scan_Flag)
		{
			Key_Scan_Flag = 0;
			Key_Scan();
		}*/
		
		HeartBeat_Manager();
		
		uint32_t can_id;
        uint8_t can_data[8];
        uint8_t can_len;
        uint8_t rx_count = 0U;
        while (MyCAN_Receive_Message(&can_id, &can_len, can_data) 
               && rx_count < 8U)
        {
            CAN_Data_Handler(can_id, can_len, can_data);
            rx_count++;
        }
		
        // 处理按键
        if(Key_Check(KEY_SINGLE) == KEY4_PRESS)
		{
            system_state = SYSTEM_READY;
            break;
        }
        
        // 显示传感器数据
        OLED_Clear();
		OLED2_Clear();
        OLED2_ShowString(0, 0, "Sensor Data", OLED_8X16);
        
        OLED_ShowString(0, 0, "Distance:", OLED_8X16);
        OLED_ShowNum(9*8, 0, sensor_data.distance, 4, OLED_8X16);
        OLED_ShowString(13*8 , 0, "mm", OLED_8X16);
        
		int16_t pitch_deg = sensor_data.pitch / 10;
		int16_t pitch_frac = sensor_data.pitch % 10;
        OLED_ShowString(0 , 16, "Pitch:", OLED_8X16);
		OLED_Printf(6*8, 16, OLED_8X16, "%d.%d", pitch_deg, abs(pitch_frac));
        //OLED_ShowSignedNum(6*8, 16, sensor_data.pitch, 4, OLED_8X16);
        OLED_ShowString(10*8, 16, "deg", OLED_8X16);
        
        OLED_ShowString(0, 32, "Roll:", OLED_8X16);
        OLED_ShowSignedNum(5*8, 32, sensor_data.roll, 4, OLED_8X16);
        OLED_ShowString(9*8, 32, "deg", OLED_8X16);
        
        int16_t yaw_deg = sensor_data.yaw / 10;
		int16_t yaw_frac = sensor_data.yaw % 10;

		OLED_ShowString(0, 48, "Yaw:", OLED_8X16);
		OLED_Printf(4 * 8, 48, OLED_8X16, "%d.%d",
					yaw_deg, abs(yaw_frac));
		OLED_ShowString(9 * 8, 48, "deg", OLED_8X16);
        
        OLED2_ShowString(0, 16, "Voltage:", OLED_8X16);
        OLED2_ShowNum(8*8, 16, sensor_voltage_mv, 4, OLED_8X16);
        OLED2_ShowString(12*8, 16, "mV", OLED_8X16);
        
        OLED2_ShowString(0, 48, "Key4: Back", OLED_8X16);
        
		OLED_Update();
		OLED2_Update();
		
        Delay_ms(100);
		
		IWDG_ReloadCounter();
    }
}

/** 函  数：系统状态监控模式
  * 参  数：无
  * 返回值：无
  */
void System_Monitor_Mode(void)
{
    system_state = SYSTEM_MONITOR;
    
    while(system_state == SYSTEM_MONITOR)
	{
		/*if (Key_Scan_Flag)
		{
			Key_Scan_Flag = 0;
			Key_Scan();
		}*/
		
		HeartBeat_Manager();
		
		uint32_t can_id;
        uint8_t can_data[8];
        uint8_t can_len;
        uint8_t rx_count = 0U;
        while (MyCAN_Receive_Message(&can_id, &can_len, can_data) 
               && rx_count < 8U)
        {
            CAN_Data_Handler(can_id, can_len, can_data);
            rx_count++;
        }
		
        // 处理按键
        if(Key_Check(KEY_SINGLE) == KEY4_PRESS)
		{
            system_state = SYSTEM_READY;
            break;
        }
        
        // 检查心跳状态
        uint32_t current_time = HAL_GetTick();
        for(uint8_t i = 0; i < NODE_NUM; i++)
		{
            if(current_time - heartbeat_time[i] > HEARTBEAT_TIMEOUT)
			{
                heartbeat_status[i] = 0;  // 离线
            }
			else
			{
                heartbeat_status[i] = 1;  // 在线
            }
        }
        
        // 显示系统状态
        OLED_Clear();
		OLED2_Clear();
        OLED2_ShowString(0, 0, "System Monitor", OLED_8X16);
        
        OLED_ShowString(0, 0, "ECU1:", OLED_6X8);
        OLED_ShowString(5*6, 0, heartbeat_status[0] ? "Online" : "Offline", OLED_6X8);
        
        OLED_ShowString(0, 8, "ECU2:", OLED_6X8);
        OLED_ShowString(5*6, 8, heartbeat_status[1] ? "Online" : "Offline", OLED_6X8);
        if(heartbeat_status[1])
		{
            OLED_ShowString(2*6, 16, "Speed:", OLED_6X8);
            OLED_ShowSignedNum(8*6, 16, motor_status.actual_speed, 4, OLED_6X8);
        }
        
        OLED_ShowString(0, 24, "ECU3:", OLED_6X8);
        OLED_ShowString(5*6, 24, heartbeat_status[2] ? "Online" : "Offline", OLED_6X8);
        
        //OLED_ShowString(2*6, 32, "MotorTemp:", OLED_6X8);
        //OLED_ShowNum(12*6, 32, motor_status.temperature, 3, OLED_6X8);
        //OLED_ShowString(15*6, 32, "C", OLED_6X8);
        
        OLED_ShowString(2*6, 40, "MotorCurrent:", OLED_6X8);
        OLED_ShowNum(15*6, 40, motor_status.current, 4, OLED_6X8);
        OLED_ShowString(19*6, 40, "mA", OLED_6X8);
        
        OLED_ShowString(2*6, 48, "MotorStatus:", OLED_6X8);
        OLED_ShowHexNum(14*6, 48, motor_status.status, 2, OLED_6X8);
        
        OLED2_ShowString(0, 48, "Key4: Back", OLED_8X16);
		
		OLED_Update();
		OLED2_Update();
        
        Delay_ms(100);
		
		IWDG_ReloadCounter();
    }
}

/** 函  数：CAN通信测试模式
  * 参  数：无
  * 返回值：无
  */
void CAN_Test_Mode(void)
{
    static uint8_t test_counter = 0;
    system_state = CAN_TEST;
    
    while(system_state == CAN_TEST)
	{
		/*if (Key_Scan_Flag)
		{
			Key_Scan_Flag = 0;
			Key_Scan();
		}*/
		
		HeartBeat_Manager();
		
		uint32_t can_id;
        uint8_t can_data[8];
        uint8_t can_len;
        uint8_t rx_count = 0U;
        while (MyCAN_Receive_Message(&can_id, &can_len, can_data) 
               && rx_count < 8U)
        {
            CAN_Data_Handler(can_id, can_len, can_data);
            rx_count++;
        }
		
        // 处理按键
        uint8_t key = Key_Check(KEY_SINGLE);
        if(key == KEY4_PRESS)
		{
            system_state = SYSTEM_READY;
            break;
        }
        
        // 发送测试数据
        if(key == KEY3_PRESS)
		{
            test_counter++;
            uint8_t test_data[8] = {test_counter, 0xAA, 0x55, 0x01, 0x02, 0x03, 0x04, 0x05};
            
            if(MyCAN_Send_Message(0x123, 8, test_data))
			{
                printf("Test data sent: %d\r\n", test_counter);
            }
			else
			{
                printf("Failed to send test data\r\n");
            }
        }
        
        // 显示CAN测试界面
        OLED_Clear();
		OLED2_Clear();
        OLED2_ShowString(0, 0, "CAN Test Mode", OLED_8X16);
        OLED_ShowString(0, 0, "Test Counter:", OLED_8X16);
        OLED_ShowNum(13*8, 0, test_counter, 3, OLED_8X16);
        
        OLED2_ShowString(0, 32, "Key3: Send Test", OLED_8X16);
        OLED2_ShowString(0, 48, "Key4: Back", OLED_8X16);
        
