THow-M/STM32_CAN_DVCS_Project/Firmware/ECU1_Body_Control/User/main.c
        // 显示接收到的CAN报文
        //uint32_t can_id;
        //uint8_t can_data[8];
        //uint8_t can_len;
		
		OLED_ShowString(0, 16, "RX ID:", OLED_8X16);
		OLED_ShowString(0, 32, "Data:", OLED_8X16);
        
        /*if(MyCAN_Receive_Message(&can_id, &can_len, can_data))
		{
            //OLED_ShowString(0, 16, "RX ID:", OLED_8X16);
            OLED_ShowHexNum(6*8, 16, can_id, 3, OLED_8X16);
            
            //OLED_ShowString(0, 32, "Data:", OLED_8X16);
            for(uint8_t i = 0; i < can_len && i < 8; i++)
			{
                OLED_ShowHexNum( 5*8 + 2*8*i, 32, can_data[i], 2, OLED_8X16);
            }
        }*/
		
		if(g_rx_updated)
		{
			g_rx_updated = 0;
			OLED_ShowHexNum(6*8, 16, g_last_rx_id, 3, OLED_8X16);
			for(uint8_t i = 0; i < g_last_rx_len && i < 8; i++)
			{
				OLED_ShowHexNum(5*8 + 2*8*i, 32, g_last_rx_data[i], 2, OLED_8X16);
			}
		}
		
		OLED_Update();
		OLED2_Update();
        
        Delay_ms(50);
		
		IWDG_ReloadCounter();
    }
}

/** 函  数：参数设置模式
  * 参  数：无
  * 返回值：无
  */
void Parameter_Setting_Mode(void)
{
    system_state = PARAM_SETTING;
    
    // 参数默认值
    static uint8_t can_baudrate = 2;  // 0=125k, 1=250k, 2=500k, 3=1M
    static uint8_t heartbeat_period = 1;  // 秒
    
    uint8_t selected_param = 0;
    const char *baudrate_names[] = {"125k", "250k", "500k", "1M"};
    
    while(system_state == PARAM_SETTING)
	{
		/*if (Key_Scan_Flag)
		{
			Key_Scan_Flag = 0;
			Key_Scan();
		}*/
		
		HeartBeat_Manager();
		
		uint32_t can_id;
        uint8_t can_data[8];
        uint8_t can_len;
        uint8_t rx_count = 0U;
        while (MyCAN_Receive_Message(&can_id, &can_len, can_data) 
               && rx_count < 8U)
        {
            CAN_Data_Handler(can_id, can_len, can_data);
            rx_count++;
        }
		
        uint8_t key = Key_Check(KEY_SINGLE);
        
        switch(key)
		{
            case KEY1_PRESS:  // 上
                if(selected_param > 0) selected_param--;
                break;
                
            case KEY2_PRESS:  // 下
                if(selected_param < 1) selected_param++;
                break;
                
            case KEY3_PRESS:  // 修改参数
                if(selected_param == 0)
				{
                    can_baudrate = (can_baudrate + 1) % 4;
                }
				else if(selected_param == 1)
				{
                    heartbeat_period = (heartbeat_period % 10) + 1;
                }
                break;
                
            case KEY4_PRESS:  // 保存并退出
                // 保存参数到EEPROM（这里简化处理）
                printf("Parameters saved: Baudrate=%s, Heartbeat=%ds\r\n", 
                       baudrate_names[can_baudrate], heartbeat_period);
					
				/* 重新初始化 CAN */
				CAN_DeInit(CAN1);
				MyCAN_Init((CAN_BaudRate)can_baudrate);
        
				/* 更新心跳周期 */
				g_heartbeat_period_ms = heartbeat_period * 1000U;  /* 秒转毫秒 */
				//HeartBeat_SetPeriod(heartbeat_period);
        
				/* TODO: 保存到 EEPROM/Flash */
				// EEPROM_Write(EEPROM_ADDR_CAN_BAUDRATE, can_baudrate);
				// EEPROM_Write(EEPROM_ADDR_HEARTBEAT_PERIOD, heartbeat_period);
        
				printf("Parameters applied. System restart...\r\n");
				Delay_ms(100);
				//NVIC_SystemReset();
				
                system_state = SYSTEM_READY;
                return;
        }
        
        // 显示参数设置界面
        OLED_Clear();
		OLED2_Clear();
        OLED2_ShowString(0, 0, "ParameterSetting", OLED_8X16);
        
        // CAN波特率
        OLED_ShowString(8, 0, "CANBaudrate:", OLED_8X16);
        if(selected_param == 0)
			OLED_ShowString(0, 0, ">", OLED_8X16);
		
        OLED_ShowString(2*8, 16, (char*)baudrate_names[can_baudrate], OLED_8X16);
        
        // 心跳周期
        OLED_ShowString(8, 32, "Heart Period:", OLED_8X16);
        if(selected_param == 1)
			OLED_ShowString(0, 32, ">", OLED_8X16);
		
        OLED_ShowNum(2*8, 48, heartbeat_period, 2, OLED_8X16);
        OLED_ShowString(4*8, 48, "s", OLED_8X16);
        
        OLED2_ShowString(0, 16, "Key1/2: Select", OLED_8X16);
        OLED2_ShowString(0, 32, "Key3: Change", OLED_8X16);
        OLED2_ShowString(0, 48, "Key4: Save&Back", OLED_8X16);
		
		OLED_Update();
		OLED2_Update();
		
        Delay_ms(50);
		
		IWDG_ReloadCounter();
    }
}

/** 函  数：心跳包管理
  * 参  数：无
  * 返回值：无
  */
void HeartBeat_Manager(void)
{
    static uint32_t last_heartbeat_send = 0;
    uint32_t current_time = HAL_GetTick();
    
    // 发送心跳包
    if(current_time - last_heartbeat_send > g_heartbeat_period_ms)
	{
        last_heartbeat_send = current_time;
        MyCAN_Send_Heartbeat(NODE_ID, STATUS_NORMAL, ERROR_NONE, current_time / 1000);
        
        // LED指示
        LED1_Turn();
    }
	heartbeat_time[NODE_ID - 1] = current_time;
    
    // 检查其他节点心跳
    static uint32_t last_check_time = 0;
    if(current_time - last_check_time > 1000)
	{  // 每秒检查一次
        last_check_time = current_time;
        
        for(uint8_t i = 0; i < NODE_NUM; i++)
		{
            if(i == NODE_ID - 1) continue;  // 跳过自己
            
            if(current_time - heartbeat_time[i] > HEARTBEAT_TIMEOUT)
			{
                printf("Warning: Node %d is offline!\r\n", i + 1);
                
                // LED报警
                if(i == 1) LED2_ON();  // ECU2离线
                if(i == 2) LED3_ON();  // ECU3离线
            }
			else
			{
                if(i == 1) LED2_OFF();
                if(i == 2) LED3_OFF();
            }
        }
    }
}

/** 函  数：CAN数据处理
  * 参  数：id 要处理的数据的ID，len 要处理的数据的长度，data 要处理的数据
  * 返回值：无
  */
void CAN_Data_Handler(uint32_t id, uint8_t len, uint8_t* data)
{
	if (data == NULL)
    {
        printf("CAN_Data_Handler: NULL data\r\n");
        return;
    }
	
    switch(id)
	{
        case MSG_ID_HEARTBEAT:
		{
            if (len < sizeof(HeartBeat_Data)) break;
            HeartBeat_Data hb;
            memcpy(&hb, data, sizeof(HeartBeat_Data));
            if (hb.node_id >= 1U && hb.node_id <= NODE_NUM)
            {
                heartbeat_time[hb.node_id - 1] = HAL_GetTick();
            }
            break;
        }
            
        case MSG_ID_MOTOR_STATUS:
		{
			if (len != sizeof(MotorStatus_Data))
			{
				printf("MotorStatus len err: %u\r\n", len);
				break;
			}
			
            memcpy(&motor_status, data, sizeof(MotorStatus_Data));
            
            // 如果电机状态异常，报警
            if(motor_status.status != 0)
			{
                printf("Motor Error: Status=0x%02X\r\n", motor_status.status);
                //LED4_ON();
            }
			else
			{
                //LED4_OFF();
            }
            break;
        }
            
        case MSG_ID_SENSOR_DATA:
		{
            if (len < sizeof(Sensor_Data)) break;
            memcpy(&sensor_data, data, sizeof(Sensor_Data));
            if (sensor_data.distance < 200)
            {
                printf("Warning: Distance too close! %dmm\r\n", sensor_data.distance);
            }
            break;
        }
		
