THow-M/STM32_CAN_DVCS_Project/Firmware/ECU1_Body_Control/User/main.c
		case MSG_ID_SENSOR_VOLTAGE:
		{
			SensorVoltage_Data voltage_frame;
		
			if (len != sizeof(voltage_frame))
			{
				break;
			}
		
			memcpy(&voltage_frame, data, sizeof(voltage_frame));
			sensor_voltage_mv = voltage_frame.voltage;
			break;
		}
		
		case MSG_ID_SYSTEM_CTRL:
		{
			if (len < sizeof(SystemCtrl_Data)) break;
            SystemCtrl_Data ctrl;
            memcpy(&ctrl, data, sizeof(SystemCtrl_Data));
            printf("SystemCtrl: cmd=%d\r\n", ctrl.command);
			//根据需要处理
			
			break;
		}
		
		case MSG_ID_ERROR_REPORT:
		{
			/* NULL 指针校验 */
			if (data == NULL || len < sizeof(ErrorReport_Data))
			{
				printf("ErrorReport: invalid data or len=%u\r\n", len);
				break;
			}
		
			/* 使用 memcpy 替代强制类型转换，符合 MISRA C Rule 11.3 */
			ErrorReport_Data err;
			memcpy(&err, data, sizeof(ErrorReport_Data));
		
			/* 存储到文件作用域变量，供 Error_Handler 使用 */
			s_last_error = err;
			s_error_pending = 1U;
			//打印错误报告
			printf("Error Report from Node %d: type=0x%02X, code=0x%04X, time=%u\r\n",
					err.node_id, err.error_type, err.error_code, err.timestamp);
			
			if(err.error_type == ERROR_NONE)
			{
				printf("No Error on node %d\r\n", err.node_id);
			}
			else
			{
				if(err.error_type & ERROR_CAN_COMM)
				{
					printf("CAN communication error on node %d\r\n", err.node_id);
				}
				if(err.error_type & ERROR_VOLTAGE_LOW)
				{
					printf("Voltage low on node %d\r\n", err.node_id);
				}
				if(err.error_type & ERROR_MPU6050_FAIL)
				{
					printf("MPU6050 failure on node %d\r\n", err.node_id);
				}
				if(err.error_type & ERROR_ULTRASONIC_FAIL)
				{
					printf("Ultrasonic failure on node %d\r\n", err.node_id);
				}
				if(err.error_type & ERROR_MOTOR_FAULT)
				{
					printf("Motor fault on node %d\r\n", err.node_id);
				}
				if(err.error_type & ERROR_SENSOR_FUSION)
				{
					printf("Sensor fusion error on node %d\r\n", err.node_id);
				}
				if(err.error_type & ERROR_OVERCURRENT)
				{
					printf("Overcurrent on node %d\r\n", err.node_id);
				}
				if(err.error_type & ERROR_WATCHDOG)
				{
					printf("Watchdog reset on node %d\r\n", err.node_id);
				}
				/* 检查未知错误位 */
				if(err.error_type & ~(ERROR_CAN_COMM | ERROR_VOLTAGE_LOW |
									ERROR_MPU6050_FAIL | ERROR_ULTRASONIC_FAIL |
									ERROR_MOTOR_FAULT | ERROR_SENSOR_FUSION |
									ERROR_OVERCURRENT | ERROR_WATCHDOG))
				{
					printf("Unknown error type 0x%02X on node %d\r\n",
						err.error_type, err.node_id);
				}
				/* ---- 触发安全机制：严重错误进入 SYSTEM_ERROR ---- */
				if (err.error_type & (ERROR_MOTOR_FAULT | ERROR_OVERCURRENT | ERROR_WATCHDOG))
				{
					printf("CRITICAL FAULT: Entering SYSTEM_ERROR state\r\n");
					system_state = SYSTEM_ERROR;
				}
			}
			break;
		}
            
		default:
		{	// 未知报文处理
			uint8_t print_len = (len > 8) ? 8 : len;
			printf("Unknown CAN message: ID=0x%03x, Len=%d, Data=",id,len);
			for(uint8_t i = 0;i < print_len;i ++)
			{
				printf("%02x",data[i]);
			}
			printf("\r\n");
			break;
		}
    }
	
	static uint32_t g_last_can_id = 0;
	static uint8_t g_last_can_len = 0;
	static uint8_t g_last_can_data[8] = {0};
	g_last_can_id = id;
	g_last_can_len = len;
	memcpy(g_last_can_data, data, len < 8 ? len : 8);
	
	g_rx_updated = 1;
}



int main(void) 
{
	System_Init();
	
    Show_MainMenu();
	
	printf("System started. Press keys to navigate menu.\r\n");
	
	
	
    while(1) 
	{
		/*if (Key_Scan_Flag)
		{
			Key_Scan_Flag = 0;
			Key_Scan();
		}*/
		Key_Handler();
		
		HeartBeat_Manager();
		
		// CAN数据处理
        uint32_t can_id;
        uint8_t can_data[8];
        uint8_t can_len;
        
        while(MyCAN_Receive_Message(&can_id, &can_len, can_data))
		{
            CAN_Data_Handler(can_id, can_len, can_data);
        }
        
		// 系统状态机
        switch(system_state)
		{
			case SYSTEM_IDLE:
			{
				//LED1慢闪表示等待
				static uint32_t idle_blink = 0;
				if(HAL_GetTick() - idle_blink > 1000)
				{
					idle_blink = HAL_GetTick();
					LED1_Turn();
				}
				break;
			}
			
            case SYSTEM_READY:
            {
				//LED1常亮表示就绪
				LED1_ON();
				LED2_OFF();
				LED3_OFF();
				//LED4_OFF();
                break;
			}
            
            case REMOTE_CONTROL:
            case SENSOR_DISPLAY:
            case SYSTEM_MONITOR:
            case CAN_TEST:
            case PARAM_SETTING:
                // 这些状态在各自的函数中处理
                break;
                
            case SYSTEM_ERROR:
                // 错误处理
                Error_Handler();
                break;
			
			default:
				//未知状态，复位系统
				printf("Unknown system state! Resetting...\r\n");
				NVIC_SystemReset();
				break;
        }
		/* 喂狗 */
		IWDG_ReloadCounter();
    }
}

/**
  * 函    数：错误处理
  * 参    数：无
  * 返 回 值：无
  * 说    明：基于 s_last_error / s_error_pending 状态机实现
  *           1. 接收 CAN 错误报告时由 CAN_Data_Handler 设置 s_error_pending=1
  *           2. 首次进入错误态时记录起始时间并打印错误详情
  *           3. 5 秒超时后触发系统复位
  */
void Error_Handler(void)
{
    /* LED 快闪（100ms 周期）表示错误 */
    static uint32_t last_blink = 0U;
    if (HAL_GetTick() - last_blink > 100U)
    {
        last_blink = HAL_GetTick();
        LED1_Turn();
        LED2_Turn();
        LED3_Turn();
    }

    /* 错误恢复状态变量（static，函数退出后保持） */
    static uint32_t error_start = 0U;
    static uint8_t  error_active = 0U;

    /* 收到新错误时，记录起始时间并打印 */
    if (s_error_pending && !error_active)
    {
        error_start  = HAL_GetTick();
        error_active = 1U;
        printf("=== ERROR HANDLER ACTIVATED ===\r\n");
        printf("Source: Node %d, Type: 0x%02X, Code: 0x%04X\r\n",
               s_last_error.node_id, s_last_error.error_type, s_last_error.error_code);
        printf("Time: %u ms\r\n", s_last_error.timestamp);
    }

    /* 5 秒超时后触发系统复位 */
    if (error_active && (HAL_GetTick() - error_start > 5000U))
    {
        printf("System reset after error timeout (5s)...\r\n");
        NVIC_SystemReset();
        /* NVIC_SystemReset() 不会返回 */
    }
}

void TIM2_IRQHandler(void)
{
	if (TIM_GetITStatus(TIM2, TIM_IT_Update) == SET)
	{
		Tick_ms ++;
		//Key_Scan_Flag = 1;
		Key_Scan();
		
		TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
	}
}
